crm-api/controllers/SandboxController.php

    public function actionParams($id)
    {
        $api = Api::findOne($id);
---
SELECT * FROM `ym_api` WHERE `id`='303'

    public function actionRequest()
    {
/*         $client = ApiClient::findOne(\Yii::$app->request->post('appid'));

        if(!$client || $client->appkey == \Yii::$app->request->post('secret'))
        {

        }

        if(!empty($_REQUEST['secret']) && $appkey != $_REQUEST['secret'])
        {
            OpenApiResponse::error(OpenApiError::SIGNATURE_ERROR, 'secret error');
            exit();
        } */


        $appkey = \Yii::$app->request->post('secret') . '&';
        $data =  \Yii::$app->request->post('param');

        $api = Api::findOne($data['api']);
---
SELECT * FROM `ym_api` WHERE `id`='1'

    private function apis($module)
    {
        return Api::find()
            ->leftJoin(ApiGroup::tableName().' group', Api::tableName().'.group_id = group.id')
            ->where([Api::tableName().'.module_id'=>$module])
            ->orderBy('group.priority desc, priority desc')
            ->all();
---
SELECT `ym_api`.* FROM `ym_api` LEFT JOIN `ym_api_group` `group` ON `ym_api`.group_id = group.id WHERE `ym_api`.module_id='official' ORDER BY `group`.`priority` DESC, `priority` DESC