crm-api/views/layouts/frontend.php

				<li class="y-left action">
					<a href="<?= Url::toRoute('api/index')?>">接口中心</a>
				</li>
				<?php $modules = ApiModule::find()->all();?>
---
SELECT * FROM `ym_api_module`